menu = [
    {"назва": "Кава", "ціна": 25, "опис": "Свіжо зварена кава"},
    {"назва": "Апельсиновий сік", "ціна": 30, "опис": "Свіжовижатий апельсиновий сік"},
    {"назва": "Яйця з беконом", "ціна": 80, "опис": "Смажені яйця з хрустким беконом"},
    {"назва": "Панкейки з ягодами", "ціна": 60, "опис": "М’які панкейки з ягодами та медом"},
    {"назва": "Йогурт з фруктами", "ціна": 50, "опис": "Натуральний йогурт з фруктами"},

    {"назва": "Борщ", "ціна": 55, "опис": "Червоний український суп з буряком та сметаною"},
    {"назва": "Цезар", "ціна": 80, "опис": "Салат з куркою, сухариками та пармезаном"},
    {"назва": "Піца Маргарита", "ціна": 120, "опис": "Тонке тісто з томатним соусом та сиром"},
    {"назва": "Компот", "ціна": 20, "опис": "Фруктовий компот із сезонних фруктів"},
    {"назва": "Лимонад", "ціна": 25, "опис": "Освіжаючий лимонад з лимоном та м’ятою"},

    {"назва": "Курячий суп", "ціна": 50, "опис": "Легкий суп з курячим філе та овочами"},
    {"назва": "Стейк з овочами", "ціна": 150, "опис": "Соковитий яловичий стейк з овочами на грилі"},
    {"назва": "Рататуй", "ціна": 90, "опис": "Овочеве рагу з прованськими травами"},
    {"назва": "Морковний торт", "ціна": 65, "опис": "Десерт з моркви з горіхами та медовим кремом"},
    {"назва": "Трав’яний чай", "ціна": 20, "опис": "Чай з сушених трав для заспокоєння"}
]

def show_menu_options():
    print("\n--- СИСТЕМА КЕРУВАННЯ МЕНЮ ---")
    print("1. Показати всі страви")
    print("2. Додати страву")
    print("3. Редагувати страву")
    print("4. Видалити страву")
    print("5. Показати загальну ціну")
    print("0. Вихід")

def get_total_info(menu):
    total = sum(item['ціна'] for item in menu)
    print(f"\nЗагальна сума: {total} грн")
    print(f"Кількість страв: {len(menu)}")

def get_price_by_category(menu):
    category = input("Введіть назву категорії: ")
    total = sum(item['ціна'] for item in menu if item.get('категорія') == category)
    print(f"Сума категорії {category}: {total} грн")

def sort_menu_by_price(menu):
    print("\n1. Від дешевих до дорогих")
    print("2. Від дорогих до дешевих")
    choice = input("Ваш вибір: ")
    
    is_reverse = True if choice == "2" else False
    sorted_menu = sorted(menu, key=lambda x: x['ціна'], reverse=is_reverse)
    
    for item in sorted_menu:
        print(f"{item['назва']}: {item['ціна']} грн")
