menu = [
    {"назва": "Кава", "ціна": 25, "опис": "Свіжо зварена кава"},
    {"назва": "Апельсиновий сік", "ціна": 30, "опис": "Свіжовижатий апельсиновий сік"},
    {"назва": "Яйця з беконом", "ціна": 80, "опис": "Смажені яйця з хрустким беконом"},
    {"назва": "Панкейки з ягодами", "ціна": 60, "опис": "М’які панкейки з ягодами та медом"},
    {"назва": "Йогурт з фруктами", "ціна": 50, "опис": "Натуральний йогурт з фруктами"},

    {"назва": "Борщ", "ціна": 55, "опис": "Червоний український суп з буряком та сметаною"},
    {"назва": "Цезар", "ціна": 80, "опис": "Салат з куркою, сухариками та пармезаном"},
    {"назва": "Піца Маргарита", "ціна": 120, "опис": "Тонке тісто з томатним соусом та сиром"},
    {"назва": "Компот", "ціна": 20, "опис": "Фруктовий компот із сезонних фруктів"},
    {"назва": "Лимонад", "ціна": 25, "опис": "Освіжаючий лимонад з лимоном та м’ятою"},

    {"назва": "Курячий суп", "ціна": 50, "опис": "Легкий суп з курячим філе та овочами"},
    {"назва": "Стейк з овочами", "ціна": 150, "опис": "Соковитий яловичий стейк з овочами на грилі"},
    {"назва": "Рататуй", "ціна": 90, "опис": "Овочеве рагу з прованськими травами"},
    {"назва": "Морковний торт", "ціна": 65, "опис": "Десерт з моркви з горіхами та медовим кремом"},
    {"назва": "Трав’яний чай", "ціна": 20, "опис": "Чай з сушених трав для заспокоєння"}
]


def add_new_dish(menu_list):
    print("\nДодавання нової страви")
    name = input("Введіть назву: ")

    while True:
        try:
            price = float(input("Введіть ціну: "))
            if price < 0:
                print("Помилка: ціна не може бути від'ємною")
            else:
                break
        except ValueError:
            print("Будь ласка, введіть число.")

    description = input("Введіть опис: ")
    new_dish = {
        "назва": name,
        "ціна": price,
        "опис": description,
    }
    menu.append(new_dish)
    print(f"\n Страву '{name}' успішно додано!")

def main():
    while True:
        print(
             "\n--- СИСТЕМА КЕРУВАННЯ МЕНЮ ---\n"
             "1. Показати всі страви\n"
             "2. Додати страву\n"
             "3. Редагувати страву\n"
             "4. Видалити страву\n"
             "5. Показати загальну ціну\n"
             "0. Вихід"
        )
        try:
            choose = int(input("Введіть цифру (0-5): "))
        except ValueError:
            print("Помилка! Вводити можна тільки цифри.")
            continue
        if choose == 1:
                print("\n" + "=" * 80)
                print(f"{'№':<3} | {'Назва':<20} | {'Ціна':<10} | {'Опис'}")
                print("-" * 80)
                for i, dish in enumerate(menu, 1):
                    print(f"{i:<3} | {dish['назва']:<20} | {dish['ціна']:>7} грн | {dish['опис']}")

                print("=" * 80 + "\n")
        if choose == 2:
            add_new_dish(menu)
        break
if __name__ == "__main__":
    main()