menu = [
    {"назва": "Кава", "ціна": 25, "опис": "Свіжо зварена кава"},
    {"назва": "Апельсиновий сік", "ціна": 30, "опис": "Свіжовижатий апельсиновий сік"},
    {"назва": "Яйця з беконом", "ціна": 80, "опис": "Смажені яйця з хрустким беконом"},
    {"назва": "Панкейки з ягодами", "ціна": 60, "опис": "М’які панкейки з ягодами та медом"},
    {"назва": "Йогурт з фруктами", "ціна": 50, "опис": "Натуральний йогурт з фруктами"},

    {"назва": "Борщ", "ціна": 55, "опис": "Червоний український суп з буряком та сметаною"},
    {"назва": "Цезар", "ціна": 80, "опис": "Салат з куркою, сухариками та пармезаном"},
    {"назва": "Піца Маргарита", "ціна": 120, "опис": "Тонке тісто з томатним соусом та сиром"},
    {"назва": "Компот", "ціна": 20, "опис": "Фруктовий компот із сезонних фруктів"},
    {"назва": "Лимонад", "ціна": 25, "опис": "Освіжаючий лимонад з лимоном та м’ятою"},

    {"назва": "Курячий суп", "ціна": 50, "опис": "Легкий суп з курячим філе та овочами"},
    {"назва": "Стейк з овочами", "ціна": 150, "опис": "Соковитий яловичий стейк з овочами на грилі"},
    {"назва": "Рататуй", "ціна": 90, "опис": "Овочеве рагу з прованськими травами"},
    {"назва": "Морковний торт", "ціна": 65, "опис": "Десерт з моркви з горіхами та медовим кремом"},
    {"назва": "Трав’яний чай", "ціна": 20, "опис": "Чай з сушених трав для заспокоєння"}
]

# Функція для підрахунку загальної ціни та кількості страв (Завдання Г.1, Г.4)
def get_total_stats(menu):
    total_sum = sum(item['ціна'] for item in menu)
    print(f"Загальна ціна: {total_sum} грн. Кількість страв: {len(menu)}")

# Функція для підрахунку ціни за обраною категорією (Завдання Г.2)
def get_category_price(menu):
    cat = input("Введіть категорію: ")
    res = sum(item['ціна'] for item in menu if item.get('категорія') == cat)
    print(f"Сума для {cat}: {res} грн")

# Функція для сортування меню за ціною (Завдання Г.3)
def sort_by_price(menu):
    print("1. Зростання 2. Спадання")
    rev = True if input() == "2" else False
    sorted_m = sorted(menu, key=lambda x: x['ціна'], reverse=rev)
    for i in sorted_m: print(f"{i['назва']}: {i['ціна']}")

